package web.web.service;


import java.util.ArrayList;
import java.util.Arrays;
import java.util.List;
import java.util.regex.Matcher;
import java.util.regex.Pattern;

public class TextParser {

    public static List<String> parseString(String site) {
        List<String> unnecessary = Arrays.asList("в", "без", "до", "из", "к", "на", "по", "о", "от", "перед", "при", "через", "с", "у", "за", "над", "об", "под", "про", "для", "я", "мы", "ты",
                "вы", "он", "она", "оно", "они", "себя", "мой", "моя", "мое", "мои", "наш", "наша", "наше", "наши", "твой", "твоя", "твое", "твои", "ваш", "ваша", "ваше", "ваши", "его", "ее",
                "их", "кто", "что", "какой", "каков", "чей", "который", "сколько", "где", "когда", "куда", "откуда", "зачем", "столько", "этот", "тот", "такой", "таков", "тут", "здесь", "сюда",
                "туда", "оттуда", "отсюда", "тогда", "поэтому", "затем", "весь", "всякий", "все", "сам", "самый", "каждый", "любой", "другой", "иной", "всяческий", "всюду", "везде", "всегда",
                "никто", "ничто", "некого", "нечего", "никакой", "ничей", "некто", "нечто", "некий", "некоторый", "несколько", "кое-кто", "кое-где", "кое-что", "кое-куда", "какой-либо", "сколько-нибудь",
                "куда-нибудь", "зачем-нибудь", "чей-либо", "и", "а", "но", "да", "или", "либо", "ни–ни", "то–то", "как", "не", "этой", "почему", "также");
        String[] subStr = site.replaceAll("[^а-яА-Я\\sa-zA-Z]", "").toLowerCase().split("\\s+");
        List<String> list = new ArrayList<>(Arrays.asList(subStr));
        for (String aUnnecessary : unnecessary) {
            list.removeIf(s -> s.equals(aUnnecessary));
        }
        return list;
    }
}
